```
 # module.eks.aws_autoscaling_group.workers[0] will be created 
  + resource "aws_autoscaling_group" "workers" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = (known after apply) 
      + force_delete              = (known after apply)
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = (known after apply) 
      + load_balancers            = (known after apply) 
      + max_size                  = 10
      + metrics_granularity       = "1Minute"
      + min_size                  = (known after apply)
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + placement_group           = (known after apply)
      + protect_from_scale_in     = (known after apply)
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = (known after apply) 
      + tags                      = [
          + { 
              + "key"                 = "Name"
              + "propagate_at_launch" = "true"
              + "value"               = "project-k8s-cluster-0-eks_asg"
            },
          + {
              + "key"                 = "kubernetes.io/cluster/project-k8s-cluster"
              + "propagate_at_launch" = "true" 
              + "value"               = "owned" 
            },
          + {
              + "key"                 = "k8s.io/cluster/project-k8s-cluster"
              + "propagate_at_launch" = "true"
              + "value"               = "owned"
            },
          + (known after apply),
          + {
              + "key"                 = "k8s.io/cluster-autoscaler/project-k8s-cluster"
              + "propagate_at_launch" = "false"
              + "value"               = "project-k8s-cluster"
            }, 
          + (known after apply),
          + {
              + "key"                 = "environment" 
              + "propagate_at_launch" = "true" 
              + "value"               = "qa"
            }, 
          + {
              + "key"                 = "environment"
              + "propagate_at_launch" = "true"
              + "value"               = "qa"
            },
        ]
      + target_group_arns         = (known after apply)
      + termination_policies      = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + initial_lifecycle_hook { 
          + default_result          = (known after apply) 
          + heartbeat_timeout       = (known after apply) 
          + lifecycle_transition    = (known after apply)
          + name                    = (known after apply) 
          + notification_metadata   = (known after apply)
          + notification_target_arn = (known after apply)
          + role_arn                = (known after apply)
        }
    }

```